; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v12 ?v3)
             (pred_4 ?v11 ?v5)
             (pred_5 ?v12 ?v5)
             (pred_2 ?v8 ?v12 )
	     (pred_9 ?v12)
             (pred_3 ?v2)
             (pred_6 ?v11)
             (pred_8 ?v5)
             (pred_10 ?v12)
             (pred_12 ?v11)
             (pred_11 ?v12)
             (pred_7 ))



(:action op_1
:parameters (?v4 ?v6 ?v10 ?v7)
:precondition (and (pred_3 ?v4) (pred_3 ?v6) (pred_6 ?v10) (pred_8 ?v7)
          (pred_1 ?v4 ?v6) (pred_4 ?v10 ?v7)
                   (pred_5 ?v6 ?v7) (pred_9 ?v4) 
                   (pred_10 ?v6) (pred_12 ?v10))
:effect (and  (pred_11 ?v6) (not (pred_10 ?v6))))


(:action op_5
:parameters (?v4 ?v9)
:precondition (and (pred_3 ?v4) (pred_3 ?v9)
               (pred_9 ?v4) (pred_1 ?v4 ?v9) (pred_11 ?v9))
:effect (and (pred_9 ?v9) (not (pred_9 ?v4))))

(:action op_3
:parameters (?v4 ?v10)
:precondition (and (pred_3 ?v4) (pred_6 ?v10) 
                  (pred_9 ?v4) (pred_2 ?v10 ?v4) (pred_7 ))
:effect (and (pred_12 ?v10)
   (not (pred_2 ?v10 ?v4)) (not (pred_7 ))))


(:action op_4
:parameters (?v4 ?v13 ?v1)
:precondition (and (pred_3 ?v4) (pred_6 ?v13) (pred_6 ?v1)
                  (pred_9 ?v4) (pred_12 ?v1) (pred_2 ?v13 ?v4))
:effect (and (pred_12 ?v13) (pred_2 ?v1 ?v4)
        (not (pred_12 ?v1)) (not (pred_2 ?v13 ?v4))))

(:action op_2
:parameters (?v4 ?v10)
:precondition (and (pred_3 ?v4) (pred_6 ?v10) 
                  (pred_9 ?v4) (pred_12 ?v10))
:effect (and (pred_7 ) (pred_2 ?v10 ?v4) (not (pred_12 ?v10)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_10 obj_01 obj_07 obj_02 obj_04 obj_09 obj_12 obj_05
    obj_08 obj_03
    obj_13 obj_11
    )

    (:init
       (pred_7)

       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_3 obj_01)
       (pred_3 obj_07)
       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_03)
       (pred_6 obj_13)
       (pred_6 obj_11)

       (pred_1 obj_06 obj_07)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_10 obj_06)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_07 obj_06)
       (pred_1 obj_02 obj_12)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_09 obj_12)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_12 obj_05)
       (pred_1 obj_12 obj_02)
       (pred_1 obj_12 obj_09)
       (pred_1 obj_05 obj_04)
       (pred_1 obj_05 obj_12)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_5  obj_01 obj_08)
       (pred_5  obj_04 obj_03)
       (pred_11 obj_06)
       (pred_11 obj_10)
       (pred_11 obj_07)
       (pred_11 obj_02)
       (pred_11 obj_09)
       (pred_11 obj_12)
       (pred_11 obj_05)

       (pred_4  obj_13 obj_08)
       (pred_4  obj_11 obj_03)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_11 obj_06)
       (pred_9 obj_06)
    )

    (:goal (and
       (pred_2 obj_13 obj_10)
    ))
(:constraints
  (always (not (pred_9 obj_07)))
)
)

; plan
1. (op_3 obj_06 obj_11)
   deleted: (pred_2 obj_11 obj_06) (pred_7)
   added: (pred_12 obj_11)
   goals met: 0 of 1
2. (op_5 obj_06 obj_10)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_10)
   goals met: 0 of 1
3. (op_2 obj_10 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_7) (pred_2 obj_11 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_02)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_02)
   goals met: 0 of 1
5. (op_5 obj_02 obj_12)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_12)
   goals met: 0 of 1
6. (op_5 obj_12 obj_09)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_09)
   goals met: 0 of 1
7. (op_3 obj_09 obj_13)
   deleted: (pred_2 obj_13 obj_09) (pred_7)
   added: (pred_12 obj_13)
   goals met: 0 of 1
8. (op_5 obj_09 obj_12)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_12)
   goals met: 0 of 1
9. (op_5 obj_12 obj_02)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_02)
   goals met: 0 of 1
10. (op_5 obj_02 obj_10)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_10)
   goals met: 0 of 1
11. (op_4 obj_10 obj_11 obj_13)
   deleted: (pred_12 obj_13) (pred_2 obj_11 obj_10)
   added: (pred_12 obj_11) (pred_2 obj_13 obj_10)
   goals met: 1 of 1
